# 1.Поработайте с переменными,
# создайте несколько,
# выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные,
# выведите на экран.

num_1 = 10
num_2 = -5
num_3 = 1.7

print('Переменные num_1 num_2 num_3: ', num_1,  num_2, 'и', num_3)

string_1 = input('Введите первую строку ')
num_1 = int(input('Введите первое число '))
string_2 = input('Введите вторую строку ')
num_2 = int(input('Введите второе число '))

print('Введеные значения: ', string_1, num_1, string_2, num_2)
