# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

example_list = ['August', 100, 'Price', 'Car', 5.55]

for element in example_list:
    print(element, type(element))
